# Pair Programming Pandas I


Empezamos los ejercicios de pair programming con Pandas. En esta lección hemos aprendido que son las Series y DataFrames y como podemos crearlos en Python.

El objetivo de la clase de hoy será crear unos cuántos DataFrames y Series a través de los siguientes ejercicios:
¿Qué diferencia hay entre una Serie y un DataFrame?

Momento de trabajar con Series. Contestad a las siguientes preguntas:

Crea dos listas:

- Una que se llame "valores" que tenga 7 números aleatorios.

- Otra que se llame "indices" que tenga 7 strings que se llamen como los días de la semana.

In [4]:
import pandas as pd
import numpy as np

In [5]:
valores = [1,2,3,4,5,6,7]

indices = ['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado', 'Domingo']

In [7]:
serie_semana = pd.Series(valores, indices)

serie_semana

Lunes        1
Martes       2
Miercoles    3
Jueves       4
Viernes      5
Sabado       6
Domingo      7
dtype: int64

In [22]:
dict_semana = {}

zip_semana = zip(indices,valores)

In [31]:
# un método para convertir el zip directamente a diccionario

diccionario = dict(zip(indices,valores))
diccionario

{'Lunes': 1,
 'Martes': 2,
 'Miercoles': 3,
 'Jueves': 4,
 'Viernes': 5,
 'Sabado': 6,
 'Domingo': 7}

In [24]:
# otro método para crear el diccionario con un bucle for necesitamos iterar por los valores

for k, v in zip(indices,valores):

    dict_semana.update({k : v})

dict_semana

{'Lunes': 1,
 'Martes': 2,
 'Miercoles': 3,
 'Jueves': 4,
 'Viernes': 5,
 'Sabado': 6,
 'Domingo': 7}



- A partir de estas dos listas cread una Serie donde la variable "valores" sean los valores de la Serie y la variable indices sean los índices de la Serie.

- A partir de las dos listas anteriores cread un diccionario usando un bucle for. Para hacer esto tenemos el método zip que nos permite iterar por dos listas a la vez. Más informción sobre este método.

- Crea una Serie con el diccionario creado en el punto anterior.

- ¿Qué forma tiene esta última Serie?
- ¿Qué tipo de datos tiene?
- ¿Qué tamaño tiene?
- ¿Cuáles son los índices de la Serie?
- ¿Y los values?

In [26]:
serie_dict = pd.Series(dict_semana)

serie_dict

Lunes        1
Martes       2
Miercoles    3
Jueves       4
Viernes      5
Sabado       6
Domingo      7
dtype: int64

In [34]:
print(f'La forma de la serie es {serie_dict.shape}, el tipo de datos es {serie_dict.dtypes}, el tamaño de la serie es {serie_dict.size}')

print(f'Los índices de la serie son {serie_dict.index} y los values son {serie_dict.values}')

La forma de la serie es (7,), el tipo de datos es int64, el tamaño de la serie es 7
Los índices de la serie son Index(['Lunes', 'Martes', 'Miercoles', 'Jueves', 'Viernes', 'Sabado',
       'Domingo'],
      dtype='object') y los values son [1 2 3 4 5 6 7]

- Extraed el valor para el índice "lunes"
- Extraed el valor para el índice "lunes", "martes" y "miércoles".
- Extraed el valor para el índice "lunes" y "domingo".

In [43]:
serie_dict['Lunes']

serie_dict['Lunes':'Miercoles']

Lunes        1
Martes       2
Miercoles    3
dtype: int64

In [46]:
# con la coma nos da error, con este método nos ha salido 

serie_dict[['Lunes'] + ['Domingo']]

Lunes      1
Domingo    7
dtype: int64

Es el turno de los DataFrames

- Cread un array de dos dimensiones con 4 filas y 3 columnas.
- Convertid el array en un DataFrame donde las columnas se llamen "España", "Francia" e "Italia".

In [47]:
array = np.random.randint(0,100, (4,3))

array

array([[58, 75, 76],
       [86, 71, 62],
       [36, 64, 51],
       [97, 86, 71]])

In [50]:
paises = pd.DataFrame(array)

paises

    0   1   2
0  58  75  76
1  86  71  62
2  36  64  51
3  97  86  71

In [51]:
paises = pd.DataFrame(array, columns= ['España', 'Francia', 'Italia'])

paises

   España  Francia  Italia
0      58       75      76
1      86       71      62
2      36       64      51
3      97       86      71



Descargad el archivo "medallas" y cargad el DataFrame con la siguiente línea de código:
df = pd.read_csv("medallas.csv", index_col=["País"])

📌 NOTA Para evitar problemas guardar el archivo medallas.csv a la misma altura (en la misma carpeta) que el jupyter donde estamos trabajando.

In [53]:
df = pd.read_csv("medallas.csv", index_col=["País"])

df

                 Unnamed: 0   Oro  Plata  Bronce
País
China                     1  1473    994     720
Japón                     2  1032   1037     985
Corea del Sur             3   745    663     827
Irán                      4   179    181     197
Kazajistán                5   155    158     224
India                     6   154    202     315
Tailandia                 7   132    175     278
Indonesia                 8   112    131     240
China Taipéi              9    99    144     276
Corea del Norte          10    91    120     235

In [56]:
df.loc['Tailandia', :]

Unnamed: 0      7
Oro           132
Plata         175
Bronce        278
Name: Tailandia, dtype: int64

In [59]:
df.loc[['China','Irán'], :]

       Unnamed: 0   Oro  Plata  Bronce
País
China           1  1473    994     720
Irán            4   179    181     197


- Usando el loc extraed todas las columnas de la fila de Tailandia.

- Usando el loc extraed todas las columnas de China e Irán.

- Usando el loc extraed solo las columnas de "Oro", "Plata" y "Bronce" de China e Irán.

- Usando el iloc extraed la información de la India. Devolved todas las columnas.

- Usando el iloc extraed todas las columnas de los paises que estén en posición impar. La primera que nos tendría que salir es Japón y la última Corea del Norte.

- Utilizando el código del ejercicio anterior, seleccionad unicamente las columnas "Oro", "Plata" y "Bronce".

Contestad a las siguientes preguntas:

- ¿Qué país consiguió más de 200 medallas de oro?

- ¿Qué país consiguió más de 200 medallas de oro y más de 1000 de plata?

- ¿Qué país consiguió más de 200 medallas de oro o más de 700 de bronce?

- Como vemos hay una columna que se llama Unnamed: 0 que no nos interesa. Eliminad esa columna.

- Cread una nueva columma que se llame "total" que sea el resultado de la suma de todas las medallas obtenidas por cada país.